{
  "date scrapped": "2021-08-03T15:02:50.321Z",
  "reviews": [
    {
      "name": "Redgear Pro Series (Wireless)  Gamepad ",
      "heading": "Highly recommended",
      "rating": "5",
      "review": "great product ... love it ... my favorite gamepad ... beautiful and smooth"
    },
    {
      "name": "Redgear Pro Series (Wireless)  Gamepad ",
      "heading": "Gear up with RED gear",
      "rating": "5",
      "review": "This product was a Gift and I tested everything. its such an awesome game pad at this price.1) Design ergonomics is good and built quality is decent though its a replica of xbox 360 controller.2) All buttons are strong enough but click noise is there. Analog sticks are smooth and i suggest u all to wear a THUMB GRIP over it to prevent wear of cap.3) Vibration is a fantastic one which is decent and natural. The AB and XY back lit light helps in dark.4) Playtime is good with good backup.Wir..."
    },
    {
      "name": "Redgear Pro Series (Wireless)  Gamepad ",
      "heading": "Has everything that you need",
      "rating": "5",
      "review": "You plug this in. It instantly works. And you run the games, they instantly recognise it as an Xbox 360 controller. All the controls are already mapped to where they should be and you can instantly start to play. I use this with windows 10, so I don't know how it works with others. But, even the force feedback works really great. Vibrations are nice and strong and your input varies with the pressure you apply on the buttons. It's just really a great experience playing with this controller. An..."
    },
    {
      "name": "Redgear Pro Series (Wireless)  Gamepad ",
      "heading": "Excellent gamepad considering the price point.",
      "rating": "5",
      "review": "The game pad came with excellent packaging. The Product is nice. very good infact. Got it for 999 under the sale.The usability is nice and since it has micro usb charging connector and inbuilt battery instead of mini usb and AA removable batteries as in other game pads you can use your mobiles data cable to charge it. It came with a micro usb charging cable and usb reciever(a little big ).Cons:1.The Light from the XYAB is very bleak and not noticeable in bright light however its a nice addi..."
    },
    {
      "name": "Redgear Pro Series (Wireless)  Gamepad ",
      "heading": "Terrific purchase",
      "rating": "5",
      "review": "It is one of the best consoles ever.Forget about costly consoles,it does the job perfectly.It has no cons till date.It has a very strong build quality as well as beautiful looks. Rubberised grips,with very good vibrational feedback.Triggers are a blessing.Very premium product,I dropped it twice and it doesn't have any scratches!!Whatever your budget,go for it and you won't regret it,I bet."
    },
    {
      "name": "Redgear Pro Series (Wireless)  Gamepad ",
      "heading": "Best in the market!",
      "rating": "5",
      "review": "i have used 6 months.working very well and it can be connected to (smart tv, Android tv, projector, Android phone and tablet). i didn't connected to iPhone and iPad, so i dont know if it works or not.it as speed control in joystick.(R2 and L2 has speed control).(R3 and L3 has motion control).awesome joystick.charge from adapter for 3 hours to get fully charged.charge from USB cable for 6 hours to get fully charged.if it gets fully charged, you can free play for 1 week."
    },
    {
      "name": "Redgear Pro Series (Wireless)  Gamepad ",
      "heading": "Wonderful",
      "rating": "5",
      "review": "Best in this price range. Don't waste your money in buying the original X box controller or the PS4 controller because the are not just worth the price. This Red gear gamepad has very good vibration feedback .Also has backlit ABXY keys . I have been using this for quite a few months ....no issues. Only remember to charge this via your laptop or other low power chargers.I play for about 1.5 hours of FIFA daily and it lasted for 6-7 days on one charge. Range is pretty good.No connectivity issue..."
    },
    {
      "name": "Redgear Pro Series (Wireless)  Gamepad ",
      "heading": "Mind-blowing purchase",
      "rating": "5",
      "review": "works like charm , could not get any better for a PC gamer thinking of consoling out those keyboard pops and clicks"
    },
    {
      "name": "Redgear Pro Series (Wireless)  Gamepad ",
      "heading": "Terrific purchase",
      "rating": "5",
      "review": "wow build quality is very nice support all games easy to play 2 days battery life and good delivery"
    },
    {
      "name": "Redgear Pro Series (Wireless)  Gamepad ",
      "heading": "Highly recommended",
      "rating": "5",
      "review": "Awesome Product I am writing this after 1 month of use.Pros1 Awesome Battery Backup2 Smooth Connectivity3 Fast Charging4 Good Build, nice analog sticks and    other switchesCons1 Analog Stick brushes with the outer circumference but using rubber cover will solve it.2 Makes a bit of sound.In short buy this even no need of the xbox controller just works awesome."
    }
  ]
}